src_doc/Reports/СводкаРабот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>СводкаРабот</Name>
		</Properties>
	</Report>
</MetaDataObject>

src_doc/Enums/РазделыОтчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>РазделыОтчетов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВсеЗадачиСписок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВходящиеДокументыСписок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДелаТомаСписок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДокументыПредприятияСписок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЖурналПередачиСписок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗадачиМнеСписок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗадачиОтделаСписок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗадачиОтМеняСписок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗадачиПодчиненныхСписок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗадачиПоПроектамСписок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗадачиСписок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсходящиеДокументыСписок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонтрагентыСписок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонтрольСписок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МероприятияСписок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МониторингПроцессовСписок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбращенияГражданСписок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтсутствияСписок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПисьмаСписок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроектыСписок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроцессыСписок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РаботыСписок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СамочувствиеСотрудниковСписок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭскалацияЗадач</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src_doc/Reports/СводкаРабот/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область НастройкиОтчетаПоУмолчанию

// Выполняет заполнение категорий и разделов в зависимости от варианта отчета.
// 
// Параметры:
//  КлючВариантаОтчета - Строка - Строковое название варианта отчета.
//  СписокКатегорий - СписокЗначений из СправочникСсылка.КатегорииОтчетов - В список добавляются необходимые категории.
//  СписокРазделов - СписокЗначений из СправочникСсылка.ИдентификаторыОбъектовМетаданных,
//                                     ПеречислениеСсылка.РазделыОтчетов - В список добавляются необходимые разделы.
// 
Процедура ЗаполнитьСписокКатегорийИРазделовОтчета(КлючВариантаОтчета, СписокКатегорий, СписокРазделов) Экспорт
	
	СписокРазделов.Добавить(ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Метаданные.Подсистемы.СовместнаяРабота));
	СписокКатегорий.Добавить(Справочники.КатегорииОтчетов.ПоЗадачамИПроцессам);
	СписокКатегорий.Добавить(Справочники.КатегорииОтчетов.ПоИсполнителям);
	
	ЭтоЗадачиМне =
		КлючВариантаОтчета = "ВыполненныеЗадачиМне"
		Или КлючВариантаОтчета = "ЗадачиМнеВРаботе"
		Или КлючВариантаОтчета = "ЗапланированныеЗадачиМне"
		Или КлючВариантаОтчета = "СводкаРаботПоЗадачамМне"
		Или КлючВариантаОтчета = "ОтмененныеЗадачиМне"
		Или КлючВариантаОтчета = "МояСправкаОбИсполнительскойДисциплине";
	Если ЭтоЗадачиМне Тогда
		СписокРазделов.Добавить(Перечисления.РазделыОтчетов.ЗадачиМнеСписок);
	КонецЕсли;
	
	ЭтоЗадачиОтМеня =
		КлючВариантаОтчета = "ВыполненныеЗадачиОтМеня"
		Или КлючВариантаОтчета = "ЗадачиОтМеняВРаботе"
		Или КлючВариантаОтчета = "ЗапланированныеЗадачиОтМеня"
		Или КлючВариантаОтчета = "СводкаРаботПоЗадачамОтМеня"
		Или КлючВариантаОтчета = "ОтмененныеЗадачиОтМеня";
	Если ЭтоЗадачиОтМеня Тогда
		СписокРазделов.Добавить(Перечисления.РазделыОтчетов.ЗадачиОтМеняСписок);
	КонецЕсли;
	
	ЭтоЗадачиПодчиненных =
		КлючВариантаОтчета = "ВыполненныеЗадачиПодчиненных"
		Или КлючВариантаОтчета = "ЗадачиПодчиненныхВРаботе"
		Или КлючВариантаОтчета = "ЗапланированныеЗадачиПодчиненных"
		Или КлючВариантаОтчета = "СводкаРаботПоЗадачамПодчиненных"
		Или КлючВариантаОтчета = "ОтмененныеЗадачиПодчиненных"
		Или КлючВариантаОтчета = "СправкаОбИсполнительскойДисциплинеПодчиненных";
	Если ЭтоЗадачиПодчиненных Тогда
		СписокРазделов.Добавить(Перечисления.РазделыОтчетов.ЗадачиПодчиненныхСписок);
	КонецЕсли;
	
	ЭтоЗадачиПоПроектам =
		КлючВариантаОтчета = "ВыполненныеЗадачиПоПроектам"
		Или КлючВариантаОтчета = "ЗадачиПоПроектамВРаботе"
		Или КлючВариантаОтчета = "ЗапланированныеЗадачиПоПроектам"
		Или КлючВариантаОтчета = "СводкаРаботПоПроектам"
		Или КлючВариантаОтчета = "ОтмененныеЗадачиПоПроектам";
	Если ЭтоЗадачиПоПроектам Тогда
		СписокРазделов.Добавить(Перечисления.РазделыОтчетов.ЗадачиПоПроектамСписок);
		СписокКатегорий.Добавить(Справочники.КатегорииОтчетов.ПоПроектам);
	КонецЕсли;
	
	ЭтоВсеЗадачи =
		КлючВариантаОтчета = "ВсеВыполненныеЗадачи"
		Или КлючВариантаОтчета = "ВсеЗадачиВРаботе"
		Или КлючВариантаОтчета = "ВсеЗапланированныеЗадачи"
		Или КлючВариантаОтчета = "СводкаРаботПоВсемЗадачам"
		Или КлючВариантаОтчета = "ВсеОтмененныеЗадачи"
		Или КлючВариантаОтчета = "СправкаОбИсполнительскойДисциплине";
	Если ЭтоВсеЗадачи Тогда
		СписокРазделов.Добавить(Перечисления.РазделыОтчетов.ВсеЗадачиСписок);
	КонецЕсли;
	
	ЭтоСправкаОбИсполнительскойДисциплине =
		КлючВариантаОтчета = "МояСправкаОбИсполнительскойДисциплине"
		Или КлючВариантаОтчета = "СправкаОбИсполнительскойДисциплинеПодчиненных"
		Или КлючВариантаОтчета = "СправкаОбИсполнительскойДисциплине";
	Если ЭтоСправкаОбИсполнительскойДисциплине Тогда
		СписокКатегорий.Добавить(Справочники.КатегорииОтчетов.КонтрольныеОтчеты);
		СписокКатегорий.Добавить(Справочники.КатегорииОтчетов.Просроченное);
		СписокКатегорий.Добавить(Справочники.КатегорииОтчетов.Статистические);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
